/****************************************************************
 * 实验板：  创客海51单片机实验板，以STC89C52单片机为核心，适用于51系列单片机
 * 源代码：  源码经过精心调试，逐行注释，倾心录制高品质视频教程，制作PPT文档教程
 * 温馨提示：需要开源例程源码，请到创客海技术论坛学习、讨论、下载！
 * 淘宝店铺：创客海社区一号店/二号店，希望您支持，感谢您的惠顾！
 * 程序目的：学习lcd显示应用,学习数组，
 * 函数功能: LCD驱动程序
*******************************************************************************/
#include <STC89C5xRC.H>
#include"LCD1602.h"

sbit K1 = P3^0;   //独立按键K1
sbit K2 = P3^1;   //独立按键K2
sbit K3 = P3^2;   //独立按键K3
sbit K4 = P3^3;   //独立按键K4
sbit K5 = P3^4;   //独立按键K5
sbit K6 = P3^5;   //独立按键K6
sbit K7 = P3^6;   //独立按键K7
sbit K8 = P3^7;   //独立按键K8

unsigned char WL[]="Welcome to ...";
unsigned char Key_Num[] ="Key_lable:";

/*******************************************************************************
* 主函数   : main
* 函数功能 : 显示一串字符" Wonderful Life "
*******************************************************************************/
void main(void)
{
    InitLcd1602();				    //初始化1602液晶屏
    Lcd_ShowStr(0,0,WL);       //显示一串字符 Welcome to learn
    Lcd_ShowStr(1,0,Key_Num);  //显示一串字符 Key_Value:
    while(1)
    {
        if(K1==0)
            Lcd_ShowStr(1,10,"K1");

        if(K2==0)
            Lcd_ShowStr(1,10,"K2");

        if(K3==0)
            Lcd_ShowStr(1,10,"K3");

        if(K4==0)
            Lcd_ShowStr(1,10,"K4");

        if(K5==0)
            Lcd_ShowStr(1,10,"K5");

        if(K6==0)
            Lcd_ShowStr(1,10,"K6");

        if(K7==0)
            Lcd_ShowStr(1,10,"K7");

        if(K8==0)
            Lcd_ShowStr(1,10,"K8");
    }
}