/****************************************************************
 * 实验板：  创客海51单片机实验板，以STC89C52单片机为核心，适用于51系列单片机
 * 源代码：  源码经过精心调试，逐行注释，倾心录制高品质视频教程，制作PPT文档教程
 * 温馨提示：需要开源例程源码，请到创客海技术论坛学习、讨论、下载！
 * 淘宝店铺：创客海社区一号店/二号店，希望您支持，感谢您的惠顾！
 * 程序目的：学习数码管显示应用,数组定义方法
 * 函数功能: 显示12345678，共阴极数码管
*******************************************************************************/
#include <STC89C5xRC.H>
/*******************************************************************************
* 延时子函数 : Delay1ms
* 函数功能	 : 延时1ms
*******************************************************************************/
void Delay1ms(unsigned int Xms)		//@11.0592MHz
{
    while(Xms--)
    {
        unsigned char i, j;
        ;
        i = 2;
        j = 199;
        do
        {
            while (--j);
        }
        while (--i);
    }
}

/*******************************************************************************
* 主程序    : 静态数码管显示
* 函数功能	: for循环，显示“5”，循环流动
*             把段码放数组里，相当于每一位段码加了序号标签
*             试试unsigned char code Num[]定义数组方法
*******************************************************************************/
void main()
{
    P22=0;           //关闭点阵屏，以免干扰数码管显示
    while(1)
    {
        unsigned char code Num[]= {0X3F,0X06,0x5B,0X4F,0X66,0X6D,0X7D,0X07,0X7F,0X6F}; //0,1,2,3,4,5,6,7,8,9
        unsigned char i,Sit=0x01;   //用Sit替代P0进行左移
        for (i=0; i<=7; i++)
        {
            P0=Num[i];       //送段码,显示“3”	，每一位段码都贴了标签,这个值是0X4F
            P20=1;
            P20=0;           //锁住段码到UA（74HC573）内

            P0=~(Sit<<i);    //送位码，就是送显示的位置，Sit=0x01
            P21=1;
            P21=0;           //锁住位码到UB（74HC573）内

            Delay1ms(1000);   //显示时间毫秒
        }
    }
}