/***************************************
*GB2312
*作者：创客海
*内容：计数器控制发光管
*实验板：新起点51单片机实验板
*单片机型号：STC89C52RC
***************************************/

#include <STC89C5xRC.H>
#include <INTRINS.H>
void main()
{
    //计数器T0初始化
    TMOD = 0x05;  //设置计数器模式1，0000 0101，16位定时/计数器
    TL0 = 0xfe;		//设置计数器初始值
    TH0 = 0xff;		//设置计数器初始值
    ET0 = 1;      //计数器0中断开启
    EA  = 1;      //全局中断开
    TR0 = 1;		  //计数器0开始计时

    P1  = 0xaa;
    while(1);     //主程序进入死循环，等待被中断打断
}

void T0_Delay02() interrupt 1
{
    TR0=0;	      //停止计数器T0计数
    TL0 = 0xfe;		//设置计数器初始值
    TH0 = 0xff;		//设置计数器初始值
    P1 = ~P1;
    TR0=1;        //计数器T0计数
}
