/***************************************
*GB2312
*作者：创客海
*内容：定时器控制发光管
*实验板：新起点51单片机实验板
*单片机型号：STC89C52RC
***************************************/

#include <STC89C5xRC.H>
#include <INTRINS.H>
unsigned char i = 0;//全局变量，存放定时器的中断次数值，每50毫秒中断1次，20次就是1秒
void main()
{
    //定时器T0初始化
    TMOD = 0x01;  //设置定时器模式1,0000 0001，16位定时/计数器
    TL0 = 0x00;		//设置定时初始值
    TH0 = 0x4C;		//设置定时初始值
    ET0 = 1;      //定时器0中断开启
    EA  = 1;      //全局中断开
    TR0 = 1;     	//定时器0开始计时

    P1  = 0xaa;	  //1010 1010
    while(1);     //主程序进入死循环，等待被中断打断
}

void T0_Delay01() interrupt 1
{
    TR0 = 0;	    //停止定时器T0计数
    TL0 = 0x00;		//设置定时初始值
    TH0 = 0x4C;		//设置定时初始值
    TR0 = 1;	    //定时器T0计数
    i++;
    if(i == 20)
    {
        i = 0;
        P1 = ~P1;//0101 0101
    }
}
