/***************************************
*GB2312
*作者：创客海
*内容：流水灯项目理论课-闪烁灯
*实验板：新起点51单片机实验板
*单片机型号：STC89C52RC
***************************************/

#include <STC89C5xRC.H>//引用了头文件，如果没有可用reg51.h代替

sbit LED0 = P1 ^ 0;//位声明了P1.0引脚为led0

void main()//主函数，程序的入口
{
    unsigned int i;//定义main函数内的局部变量i
    while (1)//死循环
    {
        LED0 = 0;//将发光管LED0点亮
        i = 50000;//将i赋值为整数50000
        while (i--);//执行i次空操作
        LED0 = 1;
        i = 50000;
        while (i--);
    }
    /*
    while(1)//在死循环中对P1的I/O口进行赋值
    {
        P1 = 0xfe;//1111 1111
    }
    */
}
/*
//前面的实验是闪烁灯，后面的实验是改变闪烁间隔的闪烁
void main()//主函数，程序的入口
{
	unsigned int i, j;//定义main函数内的局部变量i、j
	j = 50000;//将j赋值为整数50000

	while (1)//死循环
	{
		LED0 = 0;
		i = j;
		while (i--);
		LED0 = 1;
		i = j;
		while (i--);

		j = j / 10 * 9;//j的值是原来的0.9倍，改变j的值可以减少闪烁间隔
	}
}
*/