/***************************************
*GB2312
*作者：创客海
*内容：独立按键控制发光管
*实验板：新起点51单片机实验板
*单片机型号：STC89C52RC
***************************************/

#include <STC89C5xRC.H>
//#include <INTRINS.H>

sbit K1 = P3^0;//位声明了P3.0引脚为按键K1
sbit K2 = P3^1;//位声明了P3.1引脚为按键K2
sbit K3 = P3^2;//位声明了P3.2引脚为按键K3
sbit K4 = P3^3;//位声明了P3.3引脚为按键K4
sbit K5 = P3^4;//位声明了P3.4引脚为按键K5
sbit K6 = P3^5;//位声明了P3.5引脚为按键K6
sbit K7 = P3^6;//位声明了P3.6引脚为按键K7
sbit K8 = P3^7;//位声明了P3.7引脚为按键K8

sbit L0 = P1^0;//位声明了P1.0引脚为led0
sbit L1 = P1^1;//位声明了P1.1引脚为led1
sbit L2 = P1^2;//位声明了P1.2引脚为led2
sbit L3 = P1^3;//位声明了P1.3引脚为led3
sbit L4 = P1^4;//位声明了P1.4引脚为led4
sbit L5 = P1^5;//位声明了P1.5引脚为led5
sbit L6 = P1^6;//位声明了P1.6引脚为led6
sbit L7 = P1^7;//位声明了P1.7引脚为led7

sbit LCD_EN = P2 ^ 5;     // 位声明了LCD1602、12864的液晶屏使能端
sbit DS1302_RST = P2 ^ 4; // 位声明了DS1302的温湿度传感器使能端
sbit DUAN = P2 ^ 0;       // 位声明了数码管字段码的锁存器使能端
sbit WEI = P2 ^ 1;        // 位声明了数码管位置码的锁存器使能端
sbit CS88 = P2 ^ 2;       // 位声明了点阵屏行列的列锁存器使能端

//精确延时100毫秒函数
void Delay100ms()        //@11.0592MHz
{
    unsigned char i, j;

    i = 180;
    j = 73;
    do
    {
        while (--j);
    }
    while (--i);
}

void main()
{
    LCD_EN = 0;           //如果开发板上有液晶屏，则关闭，避免实验板受到影响
    //DS1302_RST = 0;       //关闭开发板上的温湿度传感器，避免实验板受到影响
    DUAN = 0;             //锁住数码管字段码的锁存器使能端
    WEI = 0;              //锁住数码管位置码的锁存器使能端
    CS88 = 0;             //锁住点阵屏行列的列锁存器使能端

    /*
    while(1)
    {
        //L0 = K1;
        P1 = P3;
    }
    */

    while(1)
    {
        if(K1 == 0)//判断按键第一次按下
        {
            Delay100ms();//等待100毫秒，以免读到错误的数值，被按键抖动产生的高低电平影响
            if(K1 == 0)//再次做判断，以防单片机按键误触或者被其他信号干扰
            {
                L0 = ~L0;//bit,一位:0/1
                while(K1 == 0);//等待按键松开，如果松开按键，单片机就会跳出死循环，执行下面的语句
            }
        }
        if(K2 == 0)
        {
            Delay100ms();
            if(K2 == 0)
            {
                L1 = ~L1;
                while(K2 == 0);
            }
        }      //用 K2 来控制 L1 的亮灭
        if(K3 == 0)
        {
            Delay100ms();
            if(K3 == 0)
            {
                L2 = ~L2;
                while(K3 == 0);
            }
        }     //用 K3 来控制 L2 的亮灭
        if(K4 == 0)
        {
            Delay100ms();
            if(K4 == 0)
            {
                L3 = ~L3;
                while(K4 == 0);
            }
        }    //用 K4 来控制 L3 的亮灭
        if(K5 == 0)
        {
            Delay100ms();
            if(K5 == 0)
            {
                L4 = ~L4;
                while(K5 == 0);
            }
        }   //用 K5 来控制 L4 的亮灭
        if(K6 == 0)
        {
            Delay100ms();
            if(K6 == 0)
            {
                L5 = ~L5;
                while(K6 == 0);
            }
        }   //用 K6 来控制 L5 的亮灭
        if(K7 == 0)
        {
            Delay100ms();
            if(K7 == 0)
            {
                L6 = ~L6;
                while(K7 == 0);
            }
        }   //用 K7 来控制 L6 的亮灭
        if(K8 == 0)
        {
            Delay100ms();
            if(K8 == 0)
            {
                L7 = ~L7;
                while(K8 == 0);
            }
        }   //用 K8 来控制 L7 的亮灭
    }
}