/****************************************************************
 * 实验板：  创客海51单片机实验板，以STC89C52单片机为核心，适用于51系列单片机
 * 源代码：  源码经过精心调试，逐行注释，倾心录制高品质视频教程，制作PPT文档教程
 * 温馨提示：需要开源例程源码，请到创客海技术论坛学习、讨论、下载！
 * 淘宝店铺：创客海社区一号店/二号店，希望您支持，感谢您的惠顾！
 * 程序目的：学习主函数的创建方法，模块化编程，将演示子函数模块化
 * 函数功能: 蜂鸣器应用程序
*******************************************************************************/
#include <STC89C5xRC.H>

sbit Buzzer=P2^3;    //定义蜂鸣器的IO口，原理图在P2.3
/*******************************************************************************
* 延时子函数 : Delay100us,延时100微秒
* 函数功能	 : 延时1ms
*******************************************************************************/
void Delay100us(unsigned char xms)		//@11.0592MHz
{
    while(xms--)
    {
        unsigned char i;
        i = 43;
        while (--i);
    }
}
/*******************************************************************************
* 蜂鸣器子函数 : KeySound
* 函数功能	   : 带两个形参，键音频率，键音时长,
* 参数1	       : 声音频率 Freq，声音时长 Xus，以100us为单位
*******************************************************************************/
void KeySound(unsigned int Freq,Xus)		//@11.0592MHz
{
    unsigned char n;
    n=10000/Freq/2;   //根据频率参数，计算半个周期时间，
    while(Xus--)      //Xus 键音延时时间 100us为单位
    {
        //循环体，一个周期
        Buzzer=0;
        Delay100us(n);
        Buzzer=1;
        Delay100us(n);
    }
}
/*******************************************************************************
* 主函数     : main,
* 函数功能	 : 键盘按键提示音主程序,创建一个开机键音程序
*              KeySound(440,5000);  键音频率440,时长5000*100us=500毫秒*
*******************************************************************************/
void main()
{
    //开机音1，2，3，4，5，6，7，高音1
    Delay100us(200);      //延时
    KeySound(523,200);    //调用子程序，传递键音频率和鸣响时长,音节"1"

    Delay100us(200);      //延时
    KeySound(587,200);    //调用子程序，传递键音频率和鸣响时长,音节"2"

    Delay100us(200);      //延时
    KeySound(659,200);    //调用子程序，传递键音频率和鸣响时长,音节"3"

    Delay100us(200);      //延时
    KeySound(698,200);    //调用子程序，传递键音频率和鸣响时长,音节"4"

    Delay100us(200);      //延时
    KeySound(784,200);    //调用子程序，传递键音频率和鸣响时长,音节"5"

    Delay100us(200);      //延时
    KeySound(880,200);    //调用子程序，传递键音频率和鸣响时长,音节"6"

    Delay100us(200);      //延时
    KeySound(988,200);    //调用子程序，传递键音频率和鸣响时长,音节"7"

    Delay100us(200);      //延时
    KeySound(1046,200);   //调用子程序，传递键音频率和鸣响时长,高音音节"1"

    while(1)
    {
        //判断按键是否按下

        if(P30==0)		            //P32=0,按键K3被按下
        {
            Delay100us(50);         //等按键进入稳态
            if(P30==0)		        //P32=0,按键K3被按下
            {
                while(P32==0);      //等按键释放
                KeySound(523,200);  //523赫兹的频率，响动时长1秒，音节"1"
            }
        }

        if(P31==0)	                //P33=0,按键K4被按下
        {
            Delay100us(50);         //等按键进入稳态
            if(P31==0)	            //P33=0,按键K4被按下
            {
                while(P33==0);      //等按键释放
                KeySound(587,200);  //587赫兹的频率，响动时长1秒，音节"2"
            }
        }

        if(P31==0)	                //P33=0,按键K4被按下
        {
            Delay100us(50);         //等按键进入稳态
            if(P31==0)	            //P33=0,按键K4被按下
            {
                while(P33==0);      //等按键释放
                KeySound(659,200);  //659赫兹的频率，响动时长1秒，音节"3"
            }
        }

        if(P33==0)	                //P33=0,按键K4被按下
        {
            Delay100us(50);         //等按键进入稳态
            if(P33==0)	            //P33=0,按键K4被按下
            {
                while(P33==0);      //等按键释放
                KeySound(698,200);  //698赫兹的频率，响动时长1秒，音节"4"
            }
        }

        if(P34==0)	                //P33=0,按键K4被按下
        {
            Delay100us(50);         //等按键进入稳态
            if(P34==0)	            //P33=0,按键K4被按下
            {
                while(P33==0);      //等按键释放
                KeySound(784,200);  //784赫兹的频率，响动时长1秒，音节"5"
            }
        }

        if(P35==0)	                //P33=0,按键K4被按下
        {
            Delay100us(50);         //等按键进入稳态
            if(P35==0)	            //P33=0,按键K4被按下
            {
                while(P33==0);      //等按键释放
                KeySound(880,200);  //880赫兹的频率，响动时长1秒，音节"6"
            }
        }

        if(P36==0)	                //P33=0,按键K4被按下
        {
            Delay100us(50);         //等按键进入稳态
            if(P36==0)	            //P33=0,按键K4被按下
            {
                while(P33==0);      //等按键释放
                KeySound(988,200);  //988赫兹的频率，响动时长1秒，音节"7"
            }
        }

        if(P37==0)	                //P33=0,按键K4被按下
        {
            Delay100us(50);         //等按键进入稳态
            if(P37==0)	            //P33=0,按键K4被按下
            {
                while(P33==0);      //等按键释放
                KeySound(1046,200); //1046赫兹的频率，响动时长1秒，高音音节"1"
            }
        }
    }
}

