/***************************************
*GB2312
*作者：创客海
*内容：数码管静态显示动态显示理论课-数码管动态显示1、2、3、4、5、6、7、8
*实验板：新起点51单片机实验板
*单片机型号：STC89C52RC
***************************************/

#include <STC89C5xRC.H>
//#include <INTRINS.H>

sbit LCD_EN = P2 ^ 5;     // 位声明了LCD1602、12864的液晶屏使能端
sbit DS1302_RST = P2 ^ 4; // 位声明了DS1302的温湿度传感器使能端
sbit DUAN = P2 ^ 0;       // 位声明了数码管字段码的锁存器使能端
sbit WEI = P2 ^ 1;        // 位声明了数码管位置码的锁存器使能端
sbit CS88 = P2 ^ 2;       // 位声明了点阵屏行列的列锁存器使能端

//数码管逐个快速轮流显示，显示后立即关闭位码，再切换段码。避免下一个段码在上一个位码上显示
void main()
{
    //在main变量局部定义了char数据类型的数组DUAN_table，存储在code区
    char code DUAN_table[] = {0x3f, 0x06, 0x5b, 0x4f, 0x66, 0x6d, 0x7d, 0x07, 0x7f, 0x6f, 0x77, 0x7c, 0x39, 0x5e, 0x79, 0x71};
    //这个数组是共阴数码管的段码0     1     2     3     4     5     6     7     8     9     A     b     C     d     E     F

    //在main变量局部定义了char数据类型的数组WEI_table，存储在code区
    char code WEI_table[] = {0xff, 0xfe, 0xfd, 0xfb, 0xf7, 0xef, 0xdf, 0xbf, 0x7f};
    //这个数组和数码管位码， 全灭   左1   左2   左3   左4   左5   左6   左7   左8

    char i;

    LCD_EN = 0;           //如果开发板上有液晶屏，则关闭，避免实验板受到影响
    DS1302_RST = 0;       //关闭开发板上的温湿度传感器，避免实验板受到影响
    DUAN = 0;             //锁住数码管字段码的锁存器使能端
    WEI = 0;              //锁住数码管位置码的锁存器使能端
    CS88 = 0;             //锁住点阵屏行列的列锁存器使能端

    while (1)
    {
        for (i = 0; i <= 8; i++)
        {
            P0 = WEI_table[0];
            WEI = 1;
            WEI = 0;

            P0 = DUAN_table[i];
            DUAN = 1; //打开锁存
            DUAN = 0; //关

            P0 = WEI_table[i];
            WEI = 1;
            WEI = 0;
        }
    }
}