/****************************************************************
 * 实验板：  创客海51单片机实验板，以STC89C52单片机为核心，适用于51系列单片机
 * 源代码：  源码经过精心调试，逐行注释，倾心录制高品质视频教程，制作PPT文档教程
 * 温馨提示：需要开源例程源码，请到创客海技术论坛学习、讨论、下载！
 * 淘宝店铺：创客海社区一号店/二号店，希望您支持，感谢您的惠顾！
 * 程序目的：学习数码管显示应用,数组定义方法
 * 函数功能: 学习数组，显示12345678，共阴极数码管
*******************************************************************************/
#include <STC89C5xRC.H>
/*******************************************************************************
* 延时子函数 : Delay1ms
* 函数功能	 : 延时1ms
*******************************************************************************/
void Delay1ms(unsigned int Xms)		//@11.0592MHz
{
    while(Xms--)
    {
        unsigned char i, j;
        ;
        i = 2;
        j = 199;
        do
        {
            while (--j);
        }
        while (--i);
    }
}

/*******************************************************************************
* 子程序    : 一位静态数码管显示
* 函数功能	: 1个段码DisNum形参，1个位码DisSit形参
*             把段码装在数组里，相当于每一位段码加了序号标签,
*             试试unsigned char idata Num[]定义数组方法
*******************************************************************************/
void Display(unsigned char DisNum,DisSit)
{
    unsigned char idata Num[]= {0X3F,0X06,0x5B,0X4F,0X66,0X6D,0X7D,0X07,0X7F,0X6F}; //0,1,2,3,4,5,6,7,8,9
    unsigned char M=0x01;   //最右边的位置是0x01，再取反

    P0=Num[DisNum];  //送段码显示，比如“5”	，取出来的数是0X6D
    P20=1;
    P20=0;           //锁住段码到UA（74HC573）内

    P0=~(M<<DisSit); //送位码DisSit，显示的位置
    P21=1;
    P21=0;           //锁住位码到UB（74HC573）内
}

/*******************************************************************************
* 主函数    : 调用静态数码管显示子函数
* 函数功能	: for循环，显示“5”，循环流动
*             把段码装在数组里，相当于每一位段码加了序号标签
*******************************************************************************/
void main()
{
    unsigned char i;
    P22=0;             //关闭点阵显示屏，避免干扰数码管显示
    while(1)
    {
        for(i=0; i<8; i++)
        {
            Display(i,i);    //例如显示数码“i”，显示位置在第i位
            Delay1ms(500);   //显示时间毫秒
        }
    }
}