/****************************************************************
 * 实验板：  创客海51单片机实验板，以STC89C52单片机为核心，适用于51系列单片机
 * 源代码：  源码经过精心调试，逐行注释，倾心录制高品质视频教程，制作PPT文档教程
 * 温馨提示：需要开源例程源码，请到创客海技术论坛学习、讨论、下载！
 * 淘宝店铺：创客海社区一号店/二号店，希望您支持，感谢您的惠顾！
 * 程序目的：学习点阵屏显示应用,学习idata数组定义
 * 函数功能: 显示一个流动ILOVEU，共阴极数码管
*******************************************************************************/
#include "NewStartC51.h"
#include "INTRINS.h"
/*******************************************************************************
 * 延时子函数 : Delay1ms
 * 函数功能	 : 延时1ms
 *******************************************************************************/
void Delay100us(unsigned int Xus) //@11.0592MHz
{
    unsigned char i;
    while (Xus--)
    {
        ;
        i = 43;
        while (--i)
            ;
    }
}
/*******************************************************************************
* 点阵屏子程序  : XDisplay
* 函数功能	    : 列数据DisData形参，第几列Sit形参
*     把每一列要显示的数据，装在数组里，整幅画面共有8列，就是8个数据
				  从左边第一列开始显示，向右扫描
*******************************************************************************/
void XDisplay(unsigned char DisData, Sit)
{
    P0 = 0xff; //关闭显示数据，消除显示余晖
    CS88 = 1;
    CS88 = 0; //锁住位码到UB（74HC573）内

    P0 = DisData; //送其中1列要显示的数据,
    DUAN = 1;
    DUAN = 0; //锁住数据到UA（74HC573）内

    P0 = ~(0x80 >> Sit); //送显示位置，列码Sit，让数据显示在第几列
    CS88 = 1;
    CS88 = 0; //锁住位码到UB（74HC573）内
}

/*******************************************************************************
* 主程序    : 动画点阵屏显示程序
* 函数功能	: 动态扫描点阵屏显示，调用点阵屏列显示子程序，2个形参
			  从左边第一列开始显示，
*       3个参数,i=画面中的列指针，Map=画面指针，Stay=画面停留时间
*******************************************************************************/
void main()
{
    unsigned char idata Num[] =
    {
        0x00,  0x81,  0x81,  0xFF,  0xFF,  0x81,  0x81,  0x00,
        0x00,  0xFF,  0xFF,  0x03,  0x03,  0x03,  0x03,  0x00,
        0x00,  0x7E,  0xFF,  0xC3,  0xC3,  0xFF,  0x7E,  0x00,
        0x00,  0xFC,  0xFE,  0x03,  0x03,  0xFE,  0xFC,  0x00,
        0x00,  0xFF,  0xFF,  0xDB,  0xDB,  0xDB,  0xDB,  0x00,
        0x00,  0xFE,  0xFF,  0x03,  0x03,  0xFF,  0xFE,  0x00,
    }; //显示“ILOVEU”

    newstart_init();
    while (1)
    {
        unsigned char i, Map, Stay;	    // Map=画面指针，Stay=动画停留时间
        for (Map = 0; Map < 40; Map++)  //修改画面指针
        {
            for (Stay = 0; Stay < 200; Stay++) // Stay<10,画面停留时间=1ms*8*100，大概1秒
            {
                for (i = 0; i < 8; i++) //显示整幅动画内容，扫描8列
                {
                    XDisplay(Num[i + Map], i); //调用子程序，i=画面中的列指针,Map=画面指针
                    Delay100us(0);			       //每一列停留时间1ms
                }
            }
        }
    }
}