/****************************************************************
 * 实验板：  创客海51单片机实验板，以STC89C52单片机为核心，适用于51系列单片机
 * 源代码：  源码经过精心调试，逐行注释，倾心录制高品质视频教程，制作PPT文档教程
 * 温馨提示：需要开源例程源码，请到创客海技术论坛学习、讨论、下载！
 * 淘宝店铺：创客海社区一号店/二号店，希望您支持，感谢您的惠顾！
 * 程序目的：串口液晶屏驱动程序，命令字等用法
********************************************************************************/
#include <STC89C5xRC.H>
#include "51UART.H"
/*******************************************************************************
* 延时子函数 : Delay1ms
* 函数功能	 : 延时1ms
*******************************************************************************/
void Delay1ms(unsigned int Xms)		//@11.0592MHz
{
    while(Xms--)
    {
        unsigned char i, j;
        ;
        i = 2;
        j = 199;
        do
        {
            while (--j);
        }
        while (--i);
    }
}

/******************************************************************************
* 发送字符串： UartSend(unsigned char *dis)
* 函数功能	:  *dis是字符串指针，字符串的结束符号是'\0'
* 发送结束  ： 只有当循环发送到结束符号时，就退出子函数
*******************************************************************************/
void UartSend(unsigned char *dis)
{
    while(*dis!='\0')   //如果字符串不是结束符号，就继续循环,结束符号是'\0'
    {
        SBUF=*dis;       //发送一个字节
        dis++;           //指针加1
        while(!TI);      //判断发送是否结束，没结束就在这里等待，TI=1时发送结束
        TI=0;            //软件清零，准备发送下一个字符
    }
}
/*******************************************************************************
* 主函数    : 串口液晶屏测定程序
* 函数功能	: 显示图片，文字，点，线，图形，基本功能走一遍
* 指示灯状态：用到串口2，通讯波特率115200，
*******************************************************************************/
void main()
{
start:
    Delay1ms(500);      //等待4000mS
    InitUART();         //UART初始化

    UartSend("DIR(1);CLR(0);\r\n");    //横屏显示，清屏命令，黑色背景
    Delay1ms(400);

    UartSend("DIR(1);CLR(0);DC16(60,20,'新起点51单片机开发板',26);\r\n");// 横屏显示，背景颜色为黑色，用黄色以(50,10)为起点,
    //在屏幕上显示透明的'51单片机开发板'这四个字,字体大小为32,4为黄色的色表编号
    Delay1ms(280);

    UartSend("PL(0,60,319,60,15);\r\n");     //画直线命令将屏幕上的(0,60)位置的点和（320,60）位置的点用白色(编号15)的直线连起来
    Delay1ms(280);

    UartSend("PL(0,120,320,120,15);\r\n");   //画直线命令同上
    Delay1ms(280);

    UartSend("PL(0,180,320,180,15);\r\n");   //画直线命令同上
    Delay1ms(280);

    UartSend("PL(0,239,320,238,15);\r\n");   //画直线命令同上
    Delay1ms(280);

    UartSend("PL(0,60,0,238,15);\r\n");      //画直线命令同上
    Delay1ms(280);

    UartSend("PL(105,60,105,238,15);\r\n");  //画直线命令同上
    Delay1ms(280);

    UartSend("PL(210,60,210,238,15);\r\n");  //画直线命令同上
    Delay1ms(280);

    UartSend("PL(318,60,318,238,15);\r\n");  //画直线命令同上
    Delay1ms(1000);

    UartSend("DIR(1);CLR(0);DC32(50,10,'51单片机开发板',4);\r\n");  // 横屏显示，背景颜色为黑色
    Delay1ms(400);

    UartSend("CIR(50,90,20,1);\r\n");      //(50,90)为圆心 20为半径用红色画一个线圆 ,1为红色的色表编号
    Delay1ms(400);

    UartSend("CIRF(60,90,20,2);\r\n");     //(60,90)为圆心 20为半径用绿色画一个填充圆, ,2为绿色的色表编号
    Delay1ms(400);

    UartSend("BOXF(140,75,180,100,3);\r\n");   //对角线(140,75)和(180,100)画填充框 ,3为蓝色的色表编号
    Delay1ms(400);

    UartSend("BOX(150,75,190,100,1);\r\n");    //对角线(150,75)和(190,100)画线框 ,1为红色的色表编号
    Delay1ms(400);

    UartSend("PS(270,85,2);\r\n");           //在屏幕的(270,85) 位置用绿色描绘一个点,2为绿色的色表编号
    Delay1ms(400);

    UartSend("PL(250,95,300,95,1);\r\n");    //画直线命令同上
    Delay1ms(400);

    UartSend("DC16(20,140,'ABC',3);\r\n");   //刷字体命令同上
    Delay1ms(400);

    UartSend("SBC(15);DCV16(60,140,'ABC',0);\r\n");   //用黑色以(60,140)为起点,在屏幕显示带白色背景色的'ABC'这四个字母,字体大小为16,0为黑色的色表编号
    Delay1ms(400);

    UartSend("DC24(120,140,'123',2);\r\n");           //刷字体命令同上
    Delay1ms(400);

    UartSend("SBC(4);DCV24(160,140,'123',0);\r\n");   //刷字体命令同上
    Delay1ms(400);

    UartSend("DC32(230,140,'深圳',2);\r\n");          //刷字体命令同上
    Delay1ms(400);

    UartSend("SBC(1);DCV32(20,190,'深圳',15);\r\n");  //刷字体命令同上
    Delay1ms(400);

    UartSend("DC48(110,190,'中国',6);\r\n");        //刷字体命令同上
    Delay1ms(400);

    UartSend("DC48(220,190,'中国',1);\r\n");        //刷字体命令同上
    Delay1ms(1000);

    UartSend("DIR(1);CLR(0);\r\n");	//横屏显示，清屏命令，黑色背景
    Delay1ms(400);

    UartSend("DC48(25,10,'2022-05-10',15);\r\n");   //刷字体命令同上
    Delay1ms(400);

    UartSend("PL(0,60,320,60,15);\r\n");       //画直线命令同上
    Delay1ms(400);

    UartSend("DC32(20,65,' 星期二',15);\r\n");   //刷字体命令同上
    Delay1ms(400);

    UartSend("DC32(150,65,' 20 ：',15);\r\n");   //刷字体命令同上
    Delay1ms(400);

    UartSend("SBC(15);DCV32(250,65,01,1);\r\n");    //刷32号字体变化数字0-50
    Delay1ms(500);

    UartSend("SBC(15);DCV32(250,65,02,1);\r\n");//刷32号字体变化数字0-50
    Delay1ms(500);

    UartSend("SBC(15);DCV32(250,65,03,1);\r\n");//刷32号字体变化数字0-50
    Delay1ms(500);

    UartSend("SBC(15);DCV32(250,65,04,1);\r\n");//刷32号字体变化数字0-50
    Delay1ms(500);

    UartSend("SBC(15);DCV24(133,130,'Love',1);\r\n");//刷32号字体变化数字0-50
    Delay1ms(500);

    UartSend("SBC(15);DCV32(133,130,'Love',1);\r\n");//刷32号字体变化数字0-50
    Delay1ms(500);

    UartSend("DIR(1);CLR(1);\r\n");    //横屏显示，清屏命令，黑色背景
    Delay1ms(500);

    UartSend("DCV32(90,102,'亮度：20 ',1);BL(220);\r\n");  //刷32号字体，亮度"BL(k);"指令，范围：0为最亮 255为最暗
    Delay1ms(1000);

    UartSend("DCV32(90,102,'亮度：50 ',1);BL(150);\r\n");  //刷32号字体，亮度"BL(k);"指令，范围：0为最亮 255为最暗
    Delay1ms(1000);

    UartSend("DCV32(90,102,'亮度：80 ',1);BL(80);\r\n");   //刷32号字体，亮度"BL(k);"指令，范围：0为最亮 255为最暗
    Delay1ms(1000);

    UartSend("DCV32(90,102,'亮度：99 ',1);BL(0);\r\n");		 //刷32号字体，亮度"BL(k);"指令，范围：0为最亮 255为最暗
    Delay1ms(1000);

    goto start ;
}
