/****************************************************************
 * 实验板：  创客海51单片机实验板，以STC89C52单片机为核心，适用于51系列单片机
 * 源代码：  源码经过精心调试，逐行注释，倾心录制高品质视频教程，制作PPT文档教程
 * 温馨提示：需要开源例程源码，请到创客海技术论坛学习、讨论、下载！
 * 淘宝店铺：创客海社区一号店/二号店，希望您支持，感谢您的惠顾！
 * 程序目的：学习主函数的创建方法
 * 函数功能: 创建流水灯方法
*******************************************************************************/
#include <STC89C5xRC.H>

/*******************************************************************************
* 延时子函数  : Delay1ms
* 函数功能	  : 带参数延时1ms
*******************************************************************************/
void Delay1ms(unsigned int xms)		//@11.0592MHz
{
    unsigned char i, j;
    while(xms--)
    {
        ;                //等价 extern void  _nop_  ();
        i = 2;
        j = 199;
        do
        {
            while (--j);
        }
        while (--i);
        //Xms--;         //递减参数(Xms--)也可以放这里
    }
}

/*******************************************************************************
* 主函数    : main
* 函数功能	: 循环移动显示
*******************************************************************************/
void main()
{
    while(1)
    {
        P10=0;          //点亮LED0
        Delay1ms(100);  //延时100ms
        P10=1;          //熄灭LED
        Delay1ms(100);	//延时100ms

        P11=0;          //点亮LED1
        Delay1ms(100);
        P11=1;
        Delay1ms(100);

        P12=0;          //点亮LED2
        Delay1ms(100);
        P12=1;
        Delay1ms(100);

        P13=0;
        Delay1ms(100);
        P13=1;
        Delay1ms(100);

        P14=0;
        Delay1ms(100);
        P14=1;
        Delay1ms(100);

        P15=0;
        Delay1ms(100);
        P15=1;
        Delay1ms(100);

        P16=0;
        Delay1ms(100);
        P16=1;
        Delay1ms(100);

        P17=0;
        Delay1ms(100);
        P17=1;
        Delay1ms(100);
    }
}